Repository: giellalt/corpus-fin
Catalog: prestable/tmx/fin2smn/facta/samemusea_siida/mattus.html.tmx
Source language: fin
Languages: smn

source: Tutkimus
smn: Tutkâmuš

source: Lauri Itkonen
smn: Heikki Mattus

source: I. Itkonen
smn: Elias Lönnrot

source: Erkki Itkonen
smn: Heikki Mattus

source: Kirjallisuusluettelo
smn: Kirjálâsvuodâ luvâttâllâm

source: Ensimmäinen kirkon edustaja, joka opetteli inarinsaamen, oli siis Inarin kappalainen ja myöhemmin Inarin-Utsjoen kirkkoherra Edvard Wilhelm Borg.
smn: Vuossâmuš kirho ovdâsteijee, kote máttááttâlâi anarâškielâ, lâi Aanaar kappallâš já maŋeláá Aanaar-Uccjuuvâ kirkkohiärrá Edvard Wilhelm Borg.

source: Oppimestarinaan hänellä oli Jurmun-Henrikki (Heikki Mattus, 1838 – 1926), joka opetti hänelle inarinsaamea, mutta opetus oli myös kaksipuolista, koska E.
smn: Oppâmiäštárin sust lâi Jormo-Hendrih (Heikki Mattus, 1838 – 1926), kote máttááttij sunjin anarâškielâ, mut máttááttâs tábáhtui meiddei nubij kulij ađai E.

source: W. Borg opetti Heikki Mattukselle suomen kieltä. Ja näin Heikki Mattus kirjoittaa vuonna 1887, joka on ilmestynyt kirjassa Inarinlappalaista kansantietoutta T.
smn: W. Borg máttááttij Jormo-Hendrihân suomâkielâ já návt Hendrih-uámikkâs čáálá ive 1887, mii almostui kirjeest Inarinlappalaista kansantietoutta T.

source: I. Itkosen kirjoitustavalla.
smn: I. Itkosii čäällimvuovvijn.

source: Tässä kuitenkin hänen oma ja alkuperäinen kirjoitustapansa:
smn: Taa lii kuittâg suu jieijâs originaal čäällimvyehi:

source: Ja näin vuorostaan Ritva Kangasniemi ja Petra Kuuva kirjoittavat inarinsaamen approbaturin tieteellisessä tekstiosassa Anarâš-lehdessä vuonna 2003 (käännös ja referointi: Ilmari Mattus):
smn: Já návt Ritva Kangasniemi já Petra Kuuvagis čäälliv approbatur čäällimkuursâ tieđâlâš tekstâuásist Anarâš-loostâst ive 2003 (referistim: Ilmari Mattus): Jormo-Hendrihist lâi meiddei mučis já ollâ veisidemjienâ, mast sun lâi pegâlmâs.
